# Before your start:
- Read the README.md file
- Comment as much as you can and use the resources (README.md file)
- Happy learning!

In [2]:
# import numpy and pandas
import pandas as pd
import numpy as np

# Challenge 1 - Exploring the Data

In this challenge, we will examine all salaries of employees of the City of Chicago. We will start by loading the dataset and examining its contents

In [3]:
# Run this code:

salaries = pd.read_csv('../Current_Employee_Names__Salaries__and_Position_Titles.csv')

Examine the `salaries` dataset using the `head` function below.

In [4]:
# Your code here:
salaries.head()

,Name,Job Titles,Department,Full or Part-Time,Salary or Hourly,Typical Hours,Annual Salary,Hourly Rate
0,"AARON, JEFFERY M",SERGEANT,POLICE,F,Salary,NaN,101442.0,NaN
1,"AARON, KARINA",POLICE OFFICER (ASSIGNED AS DETECTIVE),POLICE,F,Salary,NaN,94122.0,NaN
2,"AARON, KIMBERLEI R",CHIEF CONTRACT EXPEDITER,GENERAL SERVICES,F,Salary,NaN,101592.0,NaN
3,"ABAD JR, VICENTE M",CIVIL ENGINEER IV,WATER MGMNT,F,Salary,NaN,110064.0,NaN
4,"ABASCAL, REECE E",TRAFFIC CONTROL AIDE-HOURLY,OEMC,P,Hourly,20.0,NaN,19.86

We see from looking at the `head` function that there is quite a bit of missing data. Let's examine how much missing data is in each column. Produce this output in the cell below

In [5]:
# Your code here:
print(salaries.shape)
salaries.isnull().sum()

(33183, 8)

Name                     0
Job Titles               0
Department               0
Full or Part-Time        0
Salary or Hourly         0
Typical Hours        25161
Annual Salary         8022
Hourly Rate          25161
dtype: int64

Let's also look at the count of hourly vs. salaried employees. Write the code in the cell below

In [6]:
# Your code here:

salaries['Salary or Hourly'].value_counts()

Salary    25161
Hourly     8022
Name: Salary or Hourly, dtype: int64

What this information indicates is that the table contains information about two types of employees - salaried and hourly. Some columns apply only to one type of employee while other columns only apply to another kind. This is why there are so many missing values. Therefore, we will not do anything to handle the missing values.

There are different departments in the city. List all departments and the count of employees in each department.

In [26]:
# Your code here:

emp_dep = salaries.groupby("Department").count().loc[:,"Name"]
emp_dep

Department
ADMIN HEARNG                39
ANIMAL CONTRL               81
AVIATION                  1629
BOARD OF ELECTION          107
BOARD OF ETHICS              8
BUDGET & MGMT               46
BUILDINGS                  269
BUSINESS AFFAIRS           171
CITY CLERK                  84
CITY COUNCIL               411
COMMUNITY DEVELOPMENT      207
COPA                       116
CULTURAL AFFAIRS            65
DISABILITIES                28
DoIT                        99
FAMILY & SUPPORT           615
FINANCE                    560
FIRE                      4641
GENERAL SERVICES           980
HEALTH                     488
HUMAN RELATIONS             16
HUMAN RESOURCES             79
INSPECTOR GEN               87
LAW                        407
LICENSE APPL COMM            1
MAYOR'S OFFICE              85
OEMC                      2102
POLICE                   13414
POLICE BOARD                 2
PROCUREMENT                 92
PUBLIC LIBRARY            1015
STREETS & SAN             2198
TRANSPORTN                1140
TREASURER                   22
WATER MGMNT               1879
Name: Name, dtype: int64

# Challenge 2 - Hypothesis Tests

In this section of the lab, we will test whether the hourly wage of all hourly workers is significantly different from $30/hr. Import the correct one sample test function from scipy and perform the hypothesis test for a 95% two sided confidence interval.

In [36]:
# Your code here:
hourly = salaries.dropna(subset=['Hourly Rate']).drop(columns=["Annual Salary",'Salary or Hourly']).reset_index(drop=True)
hourly.head(5)

,Name,Job Titles,Department,Full or Part-Time,Typical Hours,Hourly Rate
0,"ABASCAL, REECE E",TRAFFIC CONTROL AIDE-HOURLY,OEMC,P,20.0,19.86
1,"ABBATACOLA, ROBERT J",ELECTRICAL MECHANIC,AVIATION,F,40.0,46.10
2,"ABBATE, JOSEPH L",POOL MOTOR TRUCK DRIVER,STREETS & SAN,F,40.0,35.60
3,"ABBOTT, BETTY L",FOSTER GRANDPARENT,FAMILY & SUPPORT,P,20.0,2.65
4,"ABDULLAH, LAKENYA N",CROSSING GUARD,OEMC,P,20.0,17.68

In [60]:
media = hourly["Hourly Rate"].mean()
dv = hourly["Hourly Rate"].std()
n = hourly["Hourly Rate"].value_counts().sum()

print("media = ",media,"| stedv = ",dv,"| n = ",n)

media =  32.78855771628024 | stedv =  12.112572684276799 | n =  8022

In [69]:
import math

#z stats:
num = (media - 30)
den = (dv/math.sqrt(n))

z=num/den

print("Z-stat =",z)

Z-stat = 20.6198057854942

In [74]:
from scipy.stats import ttest_1samp
stat,pval = ttest_1samp(hourly["Hourly Rate"],30)
print("Stat =",stat)
print("p-value =",pval)

if pval < 0.05:
    print("p-value < 0.05 --> No se puede rechazar la hipótesis nula")
else:
    print("Se rechaza la hipótesis nula")

Stat = 20.6198057854942
p-value = 4.3230240486229894e-92
p-value < 0.05 --> No se puede rechazar la hipótesis nula

We are also curious about salaries in the police force. The chief of police in Chicago claimed in a press briefing that salaries this year are higher than last year's mean of $86000/year a year for all salaried employees. Test this one sided hypothesis using a 95% confidence interval.

Hint: A one tailed test has a p-value that is half of the two tailed p-value. If our hypothesis is greater than, then to reject, the test statistic must also be positive.

In [76]:
# Your code here:
yearly = salaries.dropna(subset=['Annual Salary']).drop(columns=["Hourly Rate",'Salary or Hourly','Typical Hours']).reset_index(drop=True)
yearly.head(5)

,Name,Job Titles,Department,Full or Part-Time,Annual Salary
0,"AARON, JEFFERY M",SERGEANT,POLICE,F,101442.0
1,"AARON, KARINA",POLICE OFFICER (ASSIGNED AS DETECTIVE),POLICE,F,94122.0
2,"AARON, KIMBERLEI R",CHIEF CONTRACT EXPEDITER,GENERAL SERVICES,F,101592.0
3,"ABAD JR, VICENTE M",CIVIL ENGINEER IV,WATER MGMNT,F,110064.0
4,"ABBASI, CHRISTOPHER",STAFF ASST TO THE ALDERMAN,CITY COUNCIL,F,50436.0

In [80]:
# Your code here:
media = yearly['Annual Salary'].mean()
dv = yearly['Annual Salary'].std()
n = yearly['Annual Salary'].value_counts().sum()

print("media = ",media,"| stedv = ",dv,"| n = ",n)

#z stats:
num = (media - 86000)
den = (dv/math.sqrt(n))

z=num/den

print("Z-stat =",z)

media =  86786.99979015143 | stedv =  21041.35460162839 | n =  25161
Z-stat = 5.932870515690814

In [81]:
from scipy.stats import ttest_1samp
stat,pval = ttest_1samp(yearly['Annual Salary'],86000)
print("Stat =",stat)
print("p-value =",pval)

if pval < 0.05:
    print("p-value < 0.05 --> No se puede rechazar la hipótesis nula")
else:
    print("Se rechaza la hipótesis nula")

Stat = 5.932870515690814
p-value = 3.015758519916386e-09
p-value < 0.05 --> No se puede rechazar la hipótesis nula

The workers from the department with the most hourly workers have complained that their hourly wage is less than $35/hour. Using a one sample t-test, test this one-sided hypothesis at the 95% confidence level.

In [89]:
# Your code here:
salaries.groupby("Department").count().loc[:,"Hourly Rate"].sort_values(ascending=False).head(5)

Department
STREETS & SAN       1862
WATER MGMNT         1513
OEMC                1273
AVIATION            1082
GENERAL SERVICES     765
Name: Hourly Rate, dtype: int64

Using the `crosstab` function, find the department that has the most hourly workers.

In [113]:
cruce = pd.crosstab(salaries["Department"],salaries["Salary or Hourly"]).drop(columns="Salary")
cruce.sort_values(by="Hourly",ascending=False).head(5)

Salary or Hourly  Hourly
Department
STREETS & SAN       1862
WATER MGMNT         1513
OEMC                1273
AVIATION            1082
GENERAL SERVICES     765

In [133]:
street = salaries[salaries["Department"] == 'STREETS & SAN']
display(street.head())

def myZTest(serie,valor):

    media = serie.mean()
    media = serie.mean()
    dv = serie.std()
    n = serie.value_counts().sum()

    print("media = ",media,"| stedv = ",dv,"| n = ",n)

    #z stats:
    num = (media - valor)
    den = (dv/math.sqrt(n))

    z=num/den

    return z

,Name,Job Titles,Department,Full or Part-Time,Salary or Hourly,Typical Hours,Annual Salary,Hourly Rate
7,"ABBATE, JOSEPH L",POOL MOTOR TRUCK DRIVER,STREETS & SAN,F,Hourly,40.0,NaN,35.60
21,"ABDUL-SHAKUR, TAHIR",GENERAL LABORER - DSS,STREETS & SAN,F,Hourly,40.0,NaN,21.43
24,"ABERCROMBIE, TIMOTHY",MOTOR TRUCK DRIVER,STREETS & SAN,F,Hourly,40.0,NaN,35.60
36,"ABRAMS, DANIELLE T",SANITATION LABORER,STREETS & SAN,F,Hourly,40.0,NaN,36.21
39,"ABRAMS, SAMUEL A",POOL MOTOR TRUCK DRIVER,STREETS & SAN,F,Hourly,40.0,NaN,35.60

In [131]:
zval = myZTest(street["Hourly Rate"],35)
print(zval)

media =  33.72837808807734 | stedv =  5.735241841459235 | n =  1862
-9.567447887848152

In [134]:
stat,pval = ttest_1samp(street["Hourly Rate"],35,nan_policy="omit")
print("Stat =",stat)
print("p-value =",pval)

if pval < 0.05:
    print("p-value < 0.05 --> No se puede rechazar la hipótesis nula")
else:
    print("Se rechaza la hipótesis nula")

Stat = -9.567447887848152
p-value = 3.3378530564710738e-21
p-value < 0.05 --> No se puede rechazar la hipótesis nula

In [135]:
street = street.dropna(subset=['Hourly Rate'])
stat,pval = ttest_1samp(street["Hourly Rate"],35)
print("Stat =",stat)
print("p-value =",pval)

if pval < 0.05:
    print("p-value < 0.05 --> No se puede rechazar la hipótesis nula")
else:
    print("Se rechaza la hipótesis nula")

Stat = -9.567447887848152
p-value = 3.3378530564707717e-21
p-value < 0.05 --> No se puede rechazar la hipótesis nula

# Challenge 3 - Constructing Confidence Intervals

While testing our hypothesis is a great way to gather empirical evidence for accepting or rejecting the hypothesis, another way to gather evidence is by creating a confidence interval. A confidence interval gives us information about the true mean of the population. So for a 95% confidence interval, we are 95% sure that the mean of the population is within the confidence interval. ).

To read more about confidence intervals, click [here](https://en.wikipedia.org/wiki/Confidence_interval).

In the cell below, we will construct a 95% confidence interval for the mean hourly wage of all hourly workers.

The confidence interval is computed in SciPy using the `t.interval function`. You can read more about this function [here](https://docs.scipy.org/doc/scipy-0.14.0/reference/generated/scipy.stats.t.html).

To compute the confidence interval of the hourly wage, use the 0.95 for the confidence level, number of rows - 1 for degrees of freedom, the mean of the sample for the location parameter and the standard error for the scale. The standard error can be computed using [this](https://docs.scipy.org/doc/scipy/reference/generated/scipy.stats.sem.html) function in SciPy.

In [139]:
# Your code here:
hourly = salaries.dropna(subset=['Hourly Rate']).drop(columns=["Annual Salary",'Salary or Hourly']).reset_index(drop=True)
hourly.head(5)

,Name,Job Titles,Department,Full or Part-Time,Typical Hours,Hourly Rate
0,"ABASCAL, REECE E",TRAFFIC CONTROL AIDE-HOURLY,OEMC,P,20.0,19.86
1,"ABBATACOLA, ROBERT J",ELECTRICAL MECHANIC,AVIATION,F,40.0,46.10
2,"ABBATE, JOSEPH L",POOL MOTOR TRUCK DRIVER,STREETS & SAN,F,40.0,35.60
3,"ABBOTT, BETTY L",FOSTER GRANDPARENT,FAMILY & SUPPORT,P,20.0,2.65
4,"ABDULLAH, LAKENYA N",CROSSING GUARD,OEMC,P,20.0,17.68

In [146]:
from scipy.stats import t, sem
a = hourly["Hourly Rate"]
t.interval(0.95, len(a), loc=np.mean(a), scale=sem(a))

(32.52345834987168, 33.053657082688794)

Now construct the 95% confidence interval for all salaried employeed in the police in the cell below.

In [154]:
# Your code here:
police = salaries.dropna(subset=['Annual Salary']).drop(columns=["Hourly Rate",'Salary or Hourly','Typical Hours']).reset_index(drop=True)
police = police[police["Department"]=="POLICE"]
a = police["Annual Salary"]
t.interval(0.95, len(a), loc=np.mean(a), scale=sem(a))

(86177.05631740222, 86795.77268886456)

# Challenge 4 - Hypothesis Tests of Proportions

Another type of one sample test is a hypothesis test of proportions. In this test, we examine whether the proportion of a group in our sample is significantly different than a fraction. 

You can read more about one sample proportion tests [here](http://sphweb.bumc.bu.edu/otlt/MPH-Modules/BS/SAS/SAS6-CategoricalData/SAS6-CategoricalData2.html).

In the cell below, use the `proportions_ztest` function from `statsmodels` to perform a hypothesis test that will determine whether the number of hourly workers in the City of Chicago is significantly different from 25% at the 95% confidence level.

In [158]:
# Your code here:
from statsmodels.stats.proportion import proportions_ztest

hourly = salaries.dropna(subset=['Hourly Rate']).drop(columns=["Annual Salary",'Salary or Hourly']).reset_index(drop=True)
hourly.head(5)

,Name,Job Titles,Department,Full or Part-Time,Typical Hours,Hourly Rate
0,"ABASCAL, REECE E",TRAFFIC CONTROL AIDE-HOURLY,OEMC,P,20.0,19.86
1,"ABBATACOLA, ROBERT J",ELECTRICAL MECHANIC,AVIATION,F,40.0,46.10
2,"ABBATE, JOSEPH L",POOL MOTOR TRUCK DRIVER,STREETS & SAN,F,40.0,35.60
3,"ABBOTT, BETTY L",FOSTER GRANDPARENT,FAMILY & SUPPORT,P,20.0,2.65
4,"ABDULLAH, LAKENYA N",CROSSING GUARD,OEMC,P,20.0,17.68

In [161]:
a=hourly["Hourly Rate"]
##proportions_ztest()

#REVISAR!

NotImplementedError: more than two samples are not implemented yet